jmeter_apache-5.4.3/xml/bin/jmeter.log
2022-06-19 21:36:25,443 INFO o.a.j.u.JMeterUtils: Setting Locale to en_EN
2022-06-19 21:36:25,454 INFO o.a.j.JMeter: Loading user properties from: user.properties
2022-06-19 21:36:25,455 INFO o.a.j.JMeter: Loading system properties from: system.properties
2022-06-19 21:36:25,458 INFO o.a.j.JMeter: Copyright (c) 1998-2019 The Apache Software Foundation
2022-06-19 21:36:25,459 INFO o.a.j.JMeter: Version 5.1.1 r1855137
2022-06-19 21:36:25,459 INFO o.a.j.JMeter: java.version=1.8.0_333
2022-06-19 21:36:25,459 INFO o.a.j.JMeter: java.vm.name=Java HotSpot(TM) 64-Bit Server VM
2022-06-19 21:36:25,459 INFO o.a.j.JMeter: os.name=Windows 10
2022-06-19 21:36:25,459 INFO o.a.j.JMeter: os.arch=amd64
2022-06-19 21:36:25,459 INFO o.a.j.JMeter: os.version=10.0
2022-06-19 21:36:25,459 INFO o.a.j.JMeter: file.encoding=Cp1252
2022-06-19 21:36:25,459 INFO o.a.j.JMeter: java.awt.headless=true
2022-06-19 21:36:25,459 INFO o.a.j.JMeter: Max memory     =1073741824
2022-06-19 21:36:25,459 INFO o.a.j.JMeter: Available Processors =12
2022-06-19 21:36:25,462 INFO o.a.j.JMeter: Default Locale=English (EN)
2022-06-19 21:36:25,462 INFO o.a.j.JMeter: JMeter  Locale=English (EN)
2022-06-19 21:36:25,462 INFO o.a.j.JMeter: JMeterHome=C:\Users\Venkatesh.Sekaran\Documents\Jmeter\jmeter_apache-5.4.3\xml
2022-06-19 21:36:25,462 INFO o.a.j.JMeter: user.dir  =C:\Users\Venkatesh.Sekaran\Documents\Jmeter\jmeter_apache-5.4.3\xml\bin
2022-06-19 21:36:25,463 INFO o.a.j.JMeter: PWD       =C:\Users\Venkatesh.Sekaran\Documents\Jmeter\jmeter_apache-5.4.3\xml\bin
2022-06-19 21:36:25,464 INFO o.a.j.JMeter: IP: 192.168.0.104 Name: PBL084 FullName: PBL084.preqin1.local
2022-06-19 21:36:25,466 INFO o.a.j.JMeter: Setting property 'jmeter.reportgenerator.outputdir' to:'C:\Users\Venkatesh.Sekaran\Documents\Jmeter\jmeter_apache-5.4.3\xml\results\reports'
2022-06-19 21:36:25,467 INFO o.a.j.s.FileServer: Default base='C:\Users\Venkatesh.Sekaran\Documents\Jmeter\jmeter_apache-5.4.3\xml\bin'
2022-06-19 21:36:25,471 INFO o.a.j.s.FileServer: Set new base='C:\Users\Venkatesh.Sekaran\Documents\Jmeter\jmeter_apache-5.4.3\xml\bin'
2022-06-19 21:36:25,570 INFO o.a.j.s.SaveService: Testplan (JMX) version: 2.2. Testlog (JTL) version: 2.2
2022-06-19 21:36:25,583 INFO o.a.j.s.SaveService: Using SaveService properties file encoding UTF-8
2022-06-19 21:36:25,587 INFO o.a.j.s.SaveService: Using SaveService properties version 5.0
2022-06-19 21:36:25,591 INFO o.a.j.s.SaveService: Loading file: HTTP-Request-Testing.jmx
2022-06-19 21:36:25,629 INFO o.a.j.p.h.s.HTTPSamplerBase: Parser for text/html is org.apache.jmeter.protocol.http.parser.LagartoBasedHtmlParser
2022-06-19 21:36:25,629 INFO o.a.j.p.h.s.HTTPSamplerBase: Parser for application/xhtml+xml is org.apache.jmeter.protocol.http.parser.LagartoBasedHtmlParser
2022-06-19 21:36:25,629 INFO o.a.j.p.h.s.HTTPSamplerBase: Parser for application/xml is org.apache.jmeter.protocol.http.parser.LagartoBasedHtmlParser
2022-06-19 21:36:25,629 INFO o.a.j.p.h.s.HTTPSamplerBase: Parser for text/xml is org.apache.jmeter.protocol.http.parser.LagartoBasedHtmlParser
2022-06-19 21:36:25,629 INFO o.a.j.p.h.s.HTTPSamplerBase: Parser for text/vnd.wap.wml is org.apache.jmeter.protocol.http.parser.RegexpHTMLParser
2022-06-19 21:36:25,629 INFO o.a.j.p.h.s.HTTPSamplerBase: Parser for text/css is org.apache.jmeter.protocol.http.parser.CssParser
2022-06-19 21:36:25,647 INFO o.a.j.JMeter: Creating summariser <summary>
2022-06-19 21:36:25,652 INFO o.a.j.e.StandardJMeterEngine: Running the test!
2022-06-19 21:36:25,652 INFO o.a.j.s.SampleEvent: List of sample_variables: []
2022-06-19 21:36:25,652 INFO o.a.j.s.SampleEvent: List of sample_variables: []
2022-06-19 21:36:25,657 INFO o.a.j.e.u.CompoundVariable: Note: Function class names must contain the string: '.functions.'
2022-06-19 21:36:25,657 INFO o.a.j.e.u.CompoundVariable: Note: Function class names must not contain the string: '.gui.'
2022-06-19 21:36:25,917 INFO o.a.j.JMeter: Running test (1655654785916)
2022-06-19 21:36:25,942 INFO o.a.j.e.StandardJMeterEngine: Starting ThreadGroup: 1 : TestingApis
2022-06-19 21:36:25,942 INFO o.a.j.e.StandardJMeterEngine: Starting 1 threads for group TestingApis.
2022-06-19 21:36:25,942 INFO o.a.j.e.StandardJMeterEngine: Thread will continue on error
2022-06-19 21:36:25,942 INFO o.a.j.t.ThreadGroup: Starting thread group... number=1 threads=1 ramp-up=1 delayedStart=false
2022-06-19 21:36:25,945 INFO o.a.j.t.ThreadGroup: Started thread group number 1
2022-06-19 21:36:25,945 INFO o.a.j.e.StandardJMeterEngine: All thread groups have been started
2022-06-19 21:36:25,947 INFO o.a.j.s.SampleResult: Note: Sample TimeStamps are START times
2022-06-19 21:36:25,947 INFO o.a.j.s.SampleResult: sampleresult.default.encoding is set to ISO-8859-1
2022-06-19 21:36:25,947 INFO o.a.j.s.SampleResult: sampleresult.useNanoTime=true
2022-06-19 21:36:25,947 INFO o.a.j.s.SampleResult: sampleresult.nanoThreadSleep=5000
2022-06-19 21:36:25,947 INFO o.a.j.t.JMeterThread: Thread started: TestingApis 1-1
2022-06-19 21:36:25,962 INFO o.a.j.p.h.s.HTTPHCAbstractImpl: Local host = PBL084
2022-06-19 21:36:25,966 INFO o.a.j.p.h.s.HTTPHC4Impl: HTTP request retry count = 0
2022-06-19 21:36:26,034 INFO o.a.j.p.h.s.h.LazyLayeredConnectionSocketFactory: Setting up HTTPS TrustAll Socket Factory
2022-06-19 21:36:26,038 INFO o.a.j.u.JsseSSLManager: Using default SSL protocol: TLS
2022-06-19 21:36:26,039 INFO o.a.j.u.JsseSSLManager: SSL session context: per-thread
2022-06-19 21:36:26,621 INFO o.a.j.u.SSLManager: JmeterKeyStore Location:  type JKS
2022-06-19 21:36:26,623 INFO o.a.j.u.SSLManager: KeyStore created OK
2022-06-19 21:36:26,623 WARN o.a.j.u.SSLManager: Keystore file not found, loading empty keystore
2022-06-19 21:36:28,770 INFO o.a.j.t.JMeterThread: Thread is done: TestingApis 1-1
2022-06-19 21:36:28,770 INFO o.a.j.t.JMeterThread: Thread finished: TestingApis 1-1
2022-06-19 21:36:28,772 INFO o.a.j.e.StandardJMeterEngine: Notifying test listeners of end of test
2022-06-19 21:36:28,772 INFO o.a.j.r.Summariser: summary =      1 in 00:00:03 =    0.4/s Avg:  2745 Min:  2745 Max:  2745 Err:     0 (0.00%)